README.org

* これは何？
食べログの検索結果をcsvで出力するツールです。

* 使い方
urlに食べログの任意の検索ページの１ページ目のURLを取得し、次のように実行します。
#+begin_src shell
$ python3 scraping.py --url="https://tabelog.com/tokyo/rstLst/?vs=1&sa=%E6%9D%B1%E4%BA%AC%EF%BC%88%E3%81%99%E3%81%B9%E3%81%A6%EF%BC%89&sk=&lid=top_navi1&vac_net=&svd=20221115&svt=1900&svps=2&hfc=1&sw="
#+end_src
結果はtabelog.csvに出力されます。

* 注意
食べログの検索結果は６０ページまでしか表示されないので、適切に検索範囲を絞ってください。
